[
    {
        "title": "Data-aided Spatial Modulation",
        "author": ["Ziyuan Sha", "Xudong Zhu", "Peiyao Zhao", "Zhaocheng Wang"],
        "year": "2017",
        "description": "Spatial modulation (SM) utilizes the diversity of multiple-input multiple-output (MIMO) channel to improve the spectral efficiency. In time-variant wireless channels, its performance degrades due to the inaccuracy of channel estimation (CE). In this paper, a data-aided channel tracking (DACT) method is proposed to improve its CE accuracy in time-variant wireless channels. Specifically, the demodulated data at current time slot is used to update the subsequent channel state information (CSI). Two different DACT methods with different pilot insertion patterns are proposed: 1) Feedback DACT (FDACT) where when a symbol error is detected, the receiver will inform the transmitter to insert pilots and estimate the channel again; 2) Periodical DACT (PDACT) where pilots are inserted periodically. Theoretical analysis of CE error in time-variant channels is presented, which indicates that the CE accuracy could be significantly improved in comparison to the conventional counterpart. Moreover, the closed-form expressions of bit error rate (BER) for FDACT and frame error rate (FER) for PDACT are derived. Simulations are conducted to verify the efficiency of the proposed DACT methodologies."
    },
    {
        "title": "On the Design of Fine Grained Access Control with User Authentication Scheme for Telecare Medicine Information Systems",
        "author": ["Santanu Chatterjee", "Sandip Roy", "Ashok Kumar Das", "Samiran Chattopadhyay", "Neeraj Kumar", "Goutham Reddy Alavalapati", "Kisung Park", "YoungHo Park"],
        "year": "2017",
        "description": "Telecare medicine information system (TMIS) for health-care delivery service requires information exchange among multiple IT systems, where different types of users with different access privileges are involved. In TMIS, users generally communicate via public channels. Hence, authentication is essential to provide access to the genuine users. However, access rights for the correct information and resources for different services to the genuine users can be provided with the help of efficient user access control mechanism. Existing user authentication protocols designed for TMIS only provide authentication, but for this kind of application, it is required that the authorized users should also have unique access privilege to access specific data. This paper puts forwards a new fine grained access control with user authentication scheme for TMIS. We present the formal security analysis using both the widely-accepted Real- Or-Random (ROR) model and Burrows-Abadi-Needham (BAN) logic. The proposed scheme supports user anonymity, forward secrecy, and efficient password change without contacting the remote server. In addition, the proposed scheme is comparable with respect to communication and computation costs as compared to other related schemes proposed in TMIS. Moreover, better trade-off among security and functionality features, and communication and computation costs makes the proposed scheme suitable and practical for telecare medicine environments as compared to other existing related schemes."
    },
    {
        "title": "Business Case and Technology Analysis for 5G Low Latency Applications",
        "author": ["Maria A. Lema", "Andres Laya", "Toktam Mahmoodi", "Maria Cuevas", "Joachim Sachs", "Jan Markendahl", "Mischa Dohler"],
        "year": "2017",
        "description": "A large number of new consumer and industrial applications are likely to change the classic operator’s business models and provide a wide range of new markets to enter. This article analyses the most relevant 5G use cases that require ultralow latency, from both technical and business perspectives. Low latency services pose challenging requirements to the network, and to fulfill them operators need to invest in costly changes in their network. In this sense, it is not clear whether such investments are going to be amortized with these new business models. In light of this, specific applications and requirements are described and the potential market benefits for operators are analysed. Conclusions show that operators have clear opportunities to add value and position themselves strongly with the increasing number of services to be provided by 5G."
    },
    {
        "title": "Unbalanced Expander based Compressive Data Gathering in Clustered Wireless Sensor Networks",
        "author": ["Xiangling Li", "Xiaofeng Tao", "Guoqiang Mao"],
        "year": "2017",
        "description": "Conventional compressive sensing based data gathering (CS-DG) algorithms require a large number of sensors for each compressive sensing (CS) measurement, thereby resulting in high energy consumption in clustered Wireless Sensor Networks (WSNs). To solve this problem, we propose a novel energy-efficient CS-DG algorithm, which exploits the better reconstruction accuracy of the adjacency matrix of an unbalanced expander graph. In the proposed CS-DG algorithm, each measurement is the sum of a few sensory data which are jointly determined by random sampling and random walks. Through theoretical analysis, we prove that the constructed M × N sparse binary sensing matrix is the adjacency matrix of a ( k ,ε) unbalanced expander graph when M=O ( k log N/k ) and t=O ( Nc /( kq )) for WSNs with Nc clusters, where 0 ≤ q ≤ 1 and Nc > k . Simulation results show our proposed CS-DG has better performance than existing algorithms in terms of reconstruction accuracy and energy consumption. When Hybrid Energy-Efficient Distributed (HEED) clustering algorithm is used, to achieve the same reconstruction accuracy, our proposed CS-DG can save energy by at least 27.8%"
    },
    {
        "title": "A Parallel Nonlocal Means Algorithm for Remote Sensing Image Denoising on an Intel Xeon Phi Platform",
        "author": ["Fang Huang", "Bo Lan", "Jian Tao", "Yinjie Chen", "Xicheng Tan", "Jie Feng", "Yan Ma"],
        "year": "2017",
        "description": "The nonlocal means (NLM) algorithm is one of the best image denoising algorithms because of its superior capability to retain the texture details of an image and is widely used in remote sensing (RS) image preprocessing. However, the time complexity of the algorithm is very high due to its nonlocality when searching for similar pixels. As a result, the NLM algorithm cannot satisfy the near real-time requirements of some specific applications. To resolve this issue, a parallel NLM algorithm based on Intel Xeon Phi hardware with Intel’s Many Integrated Cores (MIC) architecture was designed and implemented in this study. The parallel algorithm achieved satisfactory speedup, but the speedup obtained showed a step-like distribution for different image sizes. This result was not expected based on the theoretical analysis, which predicted that the speedup should be independent of input dataset size. To address this problem, the parallel algorithm was further optimized by adding pretreatment approaches and cutting down the number of nested loops in the MIC. Finally, experiments using the standard and optimized versions were carried out using RS images of different sizes. Several conclusions could be drawn from the experimental results: (1) the standard parallel algorithm can obtain better speedup with only one MIC card; (2) the optimized parallel algorithm can completely eliminate the step distribution of the speedup and can also accelerate RS image processing significantly."
    },
    {
        "title": "The Internet of Things for Health Care: A Comprehensive Survey",
        "author": ["S. M. Riazul Islam", "Daehan Kwak", "MD. Humaun Kabir", "Mahmud Hossain", "Kyung-Sup Kwak"],
        "year": "2017",
        "description": "The Internet of Things (IoT) makes smart objects the ultimate building blocks in the development of cyber-physical smart pervasive frameworks. The IoT has a variety of application domains, including health care. The IoT revolution is redesigning modern health care with promising technological, economic, and social prospects. This paper surveys advances in IoT-based health care technologies and reviews the state-of-the-art network architectures/platforms, applications, and industrial trends in IoT-based health care solutions. In addition, this paper analyzes distinct IoT security and privacy features, including security requirements, threat models, and attack taxonomies from the health care perspective. Further, this paper proposes an intelligent collaborative security model to minimize security risk; discusses how different innovations such as big data, ambient intelligence, and wearables can be leveraged in a health care context; addresses various IoT and eHealth policies and regulations across the world to determine how they can facilitate economies and societies in terms of sustainable development; and provides some avenues for future research on IoT-based health care based on a set of open issues and challenges."
    },
    {
        "title": "High-Performance Extreme Learning Machines: A Complete Toolbox for Big Data Applications",
        "author": ["Anton Akusok", "Kaj-Mikael Björk", "Yoan Miche", "Amaury Lendasse"],
        "year": "2017",
        "description": "This paper presents a complete approach to a successful utilization of a high-performance extreme learning machines (ELMs) Toolbox for Big Data. It summarizes recent advantages in algorithmic performance; gives a fresh view on the ELM solution in relation to the traditional linear algebraic performance; and reaps the latest software and hardware performance achievements. The results are applicable to a wide range of machine learning problems and thus provide a solid ground for tackling numerous Big Data challenges. The included toolbox is targeted at enabling the full potential of ELMs to the widest range of users."
    },
    {
        "title": "Information Security in Big Data: Privacy and Data Mining",
        "author": ["Lei Xu", "Chunxiao Jiang", "Jian Wang", "Jian Yuan", "Yong Ren"],
        "year": "2017",
        "description": "The growing popularity and development of data mining technologies bring serious threat to the security of individual,'s sensitive information. An emerging research topic in data mining, known as privacy-preserving data mining (PPDM), has been extensively studied in recent years. The basic idea of PPDM is to modify the data in such a way so as to perform data mining algorithms effectively without compromising the security of sensitive information contained in the data. Current studies of PPDM mainly focus on how to reduce the privacy risk brought by data mining operations, while in fact, unwanted disclosure of sensitive information may also happen in the process of data collecting, data publishing, and information (i.e., the data mining results) delivering. In this paper, we view the privacy issues related to data mining from a wider perspective and investigate various approaches that can help to protect sensitive information. In particular, we identify four different types of users involved in data mining applications, namely, data provider, data collector, data miner, and decision maker. For each type of user, we discuss his privacy concerns and the methods that can be adopted to protect sensitive information. We briefly introduce the basics of related research topics, review state-of-the-art approaches, and present some preliminary thoughts on future research directions. Besides exploring the privacy-preserving approaches for each type of user, we also review the game theoretical approaches, which are proposed for analyzing the interactions among different users in a data mining scenario, each of whom has his own valuation on the sensitive information. By differentiating the responsibilities of different users with respect to security of sensitive information, we would like to provide some useful insights into the study of PPDM."
    },
    {
        "title": "A Cloud-Based Smart-Parking System Based on Internet-of-Things Technologies",
        "author": ["Thanh Nam Pham", "Ming-Fong Tsai", "Duc Binh Nguyen", "Chyi-Ren Dow", "Der-Jiunn Deng"],
        "year": "2017",
        "description": "This paper introduces a novel algorithm that increases the efficiency of the current cloud-based smart-parking system and develops a network architecture based on the Internet-of-Things technology. This paper proposed a system that helps users automatically find a free parking space at the least cost based on new performance metrics to calculate the user parking cost by considering the distance and the total number of free places in each car park. This cost will be used to offer a solution of finding an available parking space upon a request by the user and a solution of suggesting a new car park if the current car park is full. The simulation results show that the algorithm helps improve the probability of successful parking and minimizes the user waiting time. We also successfully implemented the proposed system in the real world."
    }
]

